#pragma once
#include "includes.h"

class CIndexModule
{
public:
	CIndexModule(const CIndexModule&) = delete;
	static CIndexModule* Get()
	{
		return *(CIndexModule**)((uintptr_t)(GetModuleHandle(NULL)) + 0x45D2230);
	}
public:
	char pad_0000[152]; //0x0000
	class CIndexer* IndexList; //0x0098

	enum GIndexer
	{
		AimChangeAccuracyRecoveryTimeMSFinal,
		AimChangeModifierFinal,
		AimChangeSensitivityFinal,
		AimSpreadMaxFinal,
		AimSpreadMinFinal,
		AirSupplyFinal,
		AirSupplyDepletionRateFinal,
		AirSupplyRegenRateFinal,
		AirSupplyRegenTickIntervalFinal,
		AirSupplyDepletionTickIntervalFinal,
		AirSupplyDamageRateFinal,
		AirSupplyDamageIntervalFinal,
		AirSupplyEmptyDamageDelayFinal,
		FallDamageModFinal,
		FallDamageLethalHeightFinal,
		FallDamageStartHeightFinal,
		BleedingOutHealthFinal,
		BleedingOutHealthDegenRateFinal,
		BleedingOutHealthDegenTickIntervalFinal,
		BleedingOutDieQuickMultiplierFinal,
		BleedingOutReviveHealthPercentageFinal,
		ClipSizeFinal,
		CoverAimSpreadMaxFinal,
		CoverAimSpreadMinFinal,
		CoverSpreadMaxFinal,
		CoverSpreadMinFinal,
		CriticalHitChanceResilienceFinal,
		DamageDoneToSuppressedTargetModFinal,
		DamageDoneToElitesModFinal,
		DamageMultiplierArmsFinal,
		DamageMultiplierBodyFinal,
		DamageMultiplierHeadFinal,
		DamageMultiplierLegsFinal,
		DamageTakenModFinal,
		DamageTakenModBonus,
		DamageTakenFromElitesModFinal,
		NPCDamageDoneToPlayersModFinal,
		DownedDamageMaxFinal,
		DownedDamageMaxPVPFinal,
		DownedDamageModFinal,
		DownedDamageModPVPFinal,
		DownedHealthFinal,
		DownedHealthDegenRateFinal,
		DownedHealthDegenTickIntervalFinal,
		DownedInARowMaxFinal,
		DownedInARowMaxTimePeriodFinal,
		DownedDieQuickMultiplierFinal,
		DownedReviveHealthPercentageFinal,
		TalentDownedAssistSpeedModFinal,
		TalentSecondChanceHealModFinal,
		TalentSecondChanceCooldownFinal,
		FreeWeaponReloadChanceFinal,
		HealthFinal,
		HealthRegenDelayFinal,
		HealthRegenExitCombatDelayFinal,
		HealthRegenRateFinal,
		HealthRegenTickIntervalFinal,
		HealthSegmentsFinal,
		HorizontalRecoilBorderLeftFinal,
		HorizontalRecoilBorderRightFinal,
		HorizontalRecoilLeftFinal,
		HorizontalRecoilRecoveryTimeMSFinal,
		HorizontalRecoilRightFinal,
		HorizontalRecoilTimeMSFinal,
		IncomingHealingModFinal,
		OutgoingHealingModFinal,
		DarkZoneInventoryFinal,
		DefaultInventoryFinal,
		ResourceInventoryFinal,
		VanityInventoryFinal,
		BackupSpaceInventoryFinal,
		StashInventoryFinal,
		DarkZoneStashInventoryFinal,
		MailboxInventoryFinal,
		SurvivalStashInventoryFinal,
		DarkZoneInventoryFlatBonus,
		LifeOnKillFinal,
		LootChanceModFinal,
		LootedAmmoModFinal,
		LootedGoldModFinal,
		LootMagicFindFinal,
		ScavengingExtraDropChancesFinal,
		MeleeDamagePvPFinal,
		MeleeDamageFinal,
		MeleeDamageMitigationPercentageFinal,
		MovementSpeedModFinal,
		NPCVisionRangeModFinal,
		PitchRecoveryPerSecondFinal,
		PitchRecoveryPercentFinal,
		PulseCriticalHitChanceFinal,
		PulseCriticalHitDamageFinal,
		PVPDamageModifierFinal,
		RPMFinal,
		RangeLongFinal,
		RangeMaxFinal,
		RangeOptimalFinal,
		RecoilBaseFinal,
		RecoilClimbTimeMSFinal,
		RecoilIncreasePerBulletFinal,
		RecoilMaxFinal,
		RecoilMinFinal,
		RecoilRecoveryPerSecondFinal,
		RecoilRecoveryTimeMSFinal,
		RecoilResetTimeMSFinal,
		ReloadTimeMSFinal,
		EmptyClipFirstRoundReloadTimeMSFinal,
		InitialShellReloadTimeMSFinal,
		RespawnTimeMSFinal,
		RespawnMinimumTimeFinal,
		ReviveDurationMSFinal,
		ReviveFromUnconsciousDurationMSFinal,
		LootDeadBodyDurationMSFinal,
		ReviveImmunityDurationFinal,
		ReviveImmunityRangeFinal,
		ReviveServerNotifyTickIntervalMSFinal,
		SurvivalSelfReviveMedkitCostFinal,
		SurvivalUnconsciousReviveMedkitCostFinal,
		SafetyBeltCooldownFinal,
		SkillCriticalHitChanceFinal,
		SkillCriticalHitDamageModFinal,
		SkillHasteModFinal,
		SpreadIncreaseSpeedFinal,
		SpreadIncreaseTimeMSFinal,
		SpreadMaxFinal,
		SpreadMinFinal,
		SpreadMovementModFinal,
		SpreadReductionSpeedFinal,
		StaggerDamageModifierFinal,
		StaminaConsumptionRateFinal,
		StaminaConsumptionTickIntervalFinal,
		StaminaDamageTakenModFinal,
		StaminaFinal,
		StaminaRegenDelayFinal,
		StaminaRegenRateFinal,
		StaminaRegenTickIntervalFinal,
		SuppressionFinal,
		TargetOutOfCoverDamageModFinal,
		ThrowRangeModFinal,
		TimeToMaxAccuracyMSFinal,
		TimeToMinAccuracyMSFinal,
		WeaponCriticalHitChanceFinal,
		WeaponCriticalHitDamageModFinal,
		WeaponCriticalHitChanceVsOOCFinal,
		WeaponCriticalHitChanceWhileHipFiringModFinal,
		WeaponCriticalHitChanceCap,
		WeaponCriticalHitDamageFlatBonus,
		NormalizedWeaponCriticalHitDamageFlatBonus,
		WeaponDamageMultiplierHeadModBonus,
		WeaponDamageMultiplierHeadFlatBonus,
		NormalizedWeaponDamageMultiplierHeadFlatBonus,
		WeaponDrawSpeedModFinal,
		WeaponHolsterSpeedModFinal,
		WeaponRecoilKickModBonus,
		NormalizedWeaponRecoilKickModBonus,
		WeaponSwitchSpeedModFinal,
		XPModFinal,
		YawRecoveryPerSecondFinal,
		YawRecoveryPercentFinal,
		ZoneDiscoveryXPFinal,
		PhysicalDamageMinFinal,
		PhysicalDamageMaxFinal,
		PhysicalDamageVariationFinal,
		BlastDamageMinFinal,
		BlastDamageMaxFinal,
		BlastDamageVariationFinal,
		BleedDamageMinFinal,
		BleedDamageMaxFinal,
		BleedDamageVariationFinal,
		BurnDamageMinFinal,
		BurnDamageMaxFinal,
		BurnDamageVariationFinal,
		ToxinDamageMinFinal,
		ToxinDamageMaxFinal,
		ToxinDamageVariationFinal,
		ElectricDamageMinFinal,
		ElectricDamageMaxFinal,
		ElectricDamageVariationFinal,
		NeutralDamageMinFinal,
		NeutralDamageMaxFinal,
		NeutralDamageVariationFinal,
		EMPDamageMinFinal,
		EMPDamageMaxFinal,
		EMPDamageVariationFinal,
		StaminaDamageMinFinal,
		StaminaDamageMaxFinal,
		StaminaDamageVariationFinal,
		DiseaseDamageMinFinal,
		DiseaseDamageMaxFinal,
		DiseaseDamageVariationFinal,
		ColdDamageMinFinal,
		ColdDamageMaxFinal,
		ColdDamageVariationFinal,
		TestDamageScaling,
		PrimaryOffensiveCalc,
		WeaponDamageModBonus,
		WeaponTypeDamageModCalc,
		NPCArmorFinal,
		NPCArmorBypassRatioHeadFinal,
		NPCArmorBypassRatioBodyFinal,
		NPCArmorDamageModifierFinal,
		NPCArmorBypassModifierFinal,
		PhysicalDamageMitigationPercentageFinal,
		BlastDamageMitigationPercentageFinal,
		BleedDamageMitigationPercentageFinal,
		BurnDamageMitigationPercentageFinal,
		ToxinDamageMitigationPercentageFinal,
		ElectricDamageMitigationPercentageFinal,
		NeutralDamageMitigationPercentageFinal,
		EMPDamageMitigationPercentageFinal,
		StaminaDamageMitigationPercentageFinal,
		PvPArmorDamageRatioFinal,
		ArmorMitigationPercentageCalc,
		SelfSourceDamageMitigationPercentageFinal,
		FriendlySourceDamageMitigationPercentageFinal,
		NPCSourceDamageMitigationPercentageFinal,
		OpponentSourceDamageMitigationPercentageFinal,
		NullSourceDamageMitigationPercentageFinal,
		WeaponMethodDamageMitigationPercentageFinal,
		TrapMethodDamageMitigationPercentageFinal,
		SkillMethodDamageMitigationPercentageFinal,
		StatusEffectMethodDamageMitigationPercentageFinal,
		MeleeMethodDamageMitigationPercentageFinal,
		EnvironmentMethodDamageMitigationPercentageFinal,
		BleedingStatusResistancePercentageFinal,
		BlindDeafStatusResistancePercentageFinal,
		BurningStatusResistancePercentageFinal,
		ConfusedStatusResistancePercentageFinal,
		DisruptedStatusResistancePercentageFinal,
		ShockedStatusResistancePercentageFinal,
		StaggeredStatusResistancePercentageFinal,
		SuppressedStatusResistancePercentageFinal,
		AimSwayMinHorizontalFinal,
		AimSwayMaxHorizontalFinal,
		AimSwayMinVerticalFinal,
		AimSwayMaxVerticalFinal,
		AimSwaySpeedModifierFinal,
		VisualDetectionModFinal,
		VisualStealthModFinal,
		AudialDetectionModFinal,
		AudialStealthModFinal,
		DarkZoneItemsToDropFinal,
		DarkZoneItemsToDropRogueFinal,
		DarkZoneConvertXPModFinal,
		DarkZoneXPModFinal,
		DarkZoneXPLossModFinal,
		DarkZoneXPLossRogueModFinal,
		DarkZoneXPLossFinal,
		DarkZoneXPLossRogueFinal,
		ThreatPerBulletFinal,
		ThreatTotalGeneratedModFinal,
		ThreatPerBulletDamageModFinal,
		SuppressionTriggerScoreFinal,
		SuppressionDefenseModifierFinal,
		SuppressionDepletionRateFinal,
		SuppressionDurationFinal,
		SuppressionBufferScoreFinal,
		SuppressionBufferResetTimeFinal,
		StaggerGaugeFinal,
		StaggerAnimationDurationModFinal,
		ChanceOfGreenToBlueWhenCraftingFinal,
		ChanceOfBlueToPurpleWhenCraftingFinal,
		ChanceOfPurpleToOrangeWhenCraftingFinal,
		XPRepeatableEventsModFinal,
		CreditsRepeatableEventsModFinal,
		SecurityRepeatableEventsModFinal,
		PersonnelRescueMissionsModFinal,
		SupplyDropMissionsModFinal,
		XPHeadshotKillsModFinal,
		XPTacticalKillsModFinal,
		XPSpecialKillsModFinal,
		XPEliteKillsModFinal,
		XPMultiKillsModFinal,
		XPKillsModFinal,
		XPAccoladeModFinal,
		ExtractionTimeModFinal,
		CraftingCostModFinal,
		SkillXPModFinal,
		DZRewardedCredsModFinal,
		VendorCostModFinal,
		AmmoDroppedModFinal,
		CreditsDroppedModFinal,
		LootedCreditsModFinal,
		LootedDZCreditsModFinal,
		UnlockedSkillSlotsFinal,
		SecondaryWeaponAllowedBoolFinal,
		RewardedCredsModFinal,
		PerkAutoDiscoverFinal,
		LastBulletDamageModFinal,
		SkillPowerModBonus,
		TalentGunslingerFinal,
		TalentGunslingerBonusIncFinal,
		TalentGunslingerBonusIncPvPFinal,
		TalentGunslingerBonusDecFinal,
		TalentGunslingerMaxBonusFinal,
		TalentGunslingerBonusTimeDecrementFinal,
		TalentGunslingerBonusTimeDecrementIntervalFinal,
		TalentClassifiedGunslingerFinal,
		TalentClassifiedGunslingerBonusIncFinal,
		TalentClassifiedGunslingerBonusIncPvPFinal,
		TalentClassifiedGunslingerBonusDecFinal,
		TalentClassifiedGunslingerMaxBonusFinal,
		TalentClassifiedGunslingerBonusBonus,
		TalentClassifiedGunslingerBonusFinal,
		TalentClassifiedGunslingerBonusTimeDecrementFinal,
		TalentClassifiedGunslingerBonusTimeDecrementIntervalFinal,
		TalentClassifiedGunslingerTickRateFinal,
		TalentClassifiedGunslingerPvPTickRateFinal,
		TalentNomadFinal,
		TalentClassifiedNomadFinal,
		TalentClassifiedNomadDurationFinal,
		TalentClassifiedNomadDefensiveBonusFinal,
		TalentClassifiedNomadDiminishingReturnsDurationFinal,
		TalentClassifiedNomadDiminishingReturnsFinal,
		TalentClassifiedNomadChanceForNoCooldownFinal,
		TalentNomadCooldownFinal,
		TalentNomadCooldownModifierOnPvPGameStartFinal,
		TalentWardenFinal,
		TalentWardenDamageFinal,
		TalentWardenBonusIncFinal,
		TalentWardenBonusIncFromSkillProxiesFinal,
		TalentWardenBonusDecFinal,
		TalentWardenMaxBonusFinal,
		TalentClassifiedWardenFinal,
		TalentClassifiedWardenMaxBonusFinal,
		TalentClassifiedWardenChanceFinal,
		TalentClassifiedWardenBonusResetModifierFinal,
		TalentWeaponSwapReload,
		TalentSoloFinal,
		TalentRiotShieldWithSMG,
		TalentHuntersFaithFinal,
		TalentHuntersFaithBonusIncFinal,
		TalentHuntersFaithMaxBonusFinal,
		TalentHuntersFaithDurationFinal,
		TalentClassifiedHuntersFaithFinal,
		TalentClassifiedHuntersFaithMissedShotsAllowedFinal,
		TalentPredatorsMarkFinal,
		TalentPredatorBleedCounterFinal,
		TalentPredatorBleedDamageFinal,
		TalentPredatorsMarkAdditionalPvPBleedDamageModFinal,
		TalentClassifiedPredatorsMarkFinal,
		TalentGlassHalfFullFinal,
		TalentGlassHalfFullDurationFinal,
		TalentGlassHalfFullBonusFinal,
		TalentCoverShooterFinal,
		TalentCoverShooterDurationFinal,
		TalentCoverShooterMaxBonusFinal,
		TalentCoverShooterBonusIncFinal,
		TalentDevilsHeelFinal,
		TalentDevilsHeelDurationFinal,
		TalentDevilsHeelBothTalentsFinal,
		TalentFireFinal,
		TalentFireBonusIncFromHeadshotFinal,
		TalentFireBonusIncFromBodyshotFinal,
		TalentFuryFinal,
		TalentFuryBonusIncFromWeakpointFinal,
		TalentFuryBonusIncFromEquipmentFinal,
		TalentClassifiedFireCrestFinal,
		TalentClassifiedFireCrestBurnChanceFinal,
		TalentClassifiedFireCrestExplosionDamageFinal,
		TalentClassifiedFireCrestExplosionRadiusFinal,
		TalentClassifiedFireCrestExplosionCooldownFinal,
		TalentClassifiedBansheeFinal,
		TalentClassifiedBansheeBonusDamagePerManhuntStageFinal,
		TalentClassifiedBansheeInteractDurationBonusFinal,
		TalentClassifiedBansheeInteractDurationRangeFinal,
		TalentClassifiedSoloFinal,
		TalentClassifiedSoloRotationDurationFinal,
		TalentClassifiedSoloSkillDurationFinal,
		TalentClassifiedSoloAttributeRelationPercentageFinal,
		TalentClassifiedSoloAttributeRelationPenaltyFinal,
		TalentClassifiedSoloMinAttributeRelationModifierFinal,
		PrimaryDefensiveFinal,
		PrimaryOffensiveFinal,
		PrimarySupportFinal,
		OverHealFinal,
		OverHealDepletionDelayFinal,
		OverHealDepletionRateFinal,
		SignatureSkillResourceRewardModFinal,
		CombatBuff_Cooldown_Final,
		DefenceBuff_Cooldown_Final,
		GroupHeal_Cooldown_Final,
		ModSocketAttributeBonus,
		ArmorMitigationDefaultRatingFlatBonus,
		ContaminationZoneGasMaskLevelDefaultFlatBonus,
		DefaultInventoryFlatBonus,
		WeaponDamageBaseModBonus,
		WeaponDamageAssaultRifleBaseModBonus,
		WeaponDamageLMGBaseModBonus,
		WeaponDamageMarksmanRifleBaseModBonus,
		WeaponDamagePistolBaseModBonus,
		WeaponDamageShotgunBaseModBonus,
		WeaponDamageSMGBaseModBonus,
		PrimaryOffensiveFlatBonus,
		PrimaryDefensiveFlatBonus,
		PrimarySupportFlatBonus,
		PrimaryDefensiveDefaultBaseFlatBonus,
		PrimaryOffensiveDefaultBaseFlatBonus,
		PrimarySupportDefaultBaseFlatBonus,
		PrimaryDefensiveDefaultFlatBonus,
		PrimaryOffensiveDefaultFlatBonus,
		PrimarySupportDefaultFlatBonus,
		PrimaryOffensiveClassifiedFlatBonus,
		PrimaryDefensiveClassifiedFlatBonus,
		PrimarySupportClassifiedFlatBonus,
		PrimaryDefensiveClassifiedDefaultBaseFlatBonus,
		PrimaryOffensiveClassifiedDefaultBaseFlatBonus,
		PrimarySupportClassifiedDefaultBaseFlatBonus,
		AmmoIncendiaryFinal,
		AmmoIncendiaryFlatBonus,
		AmmoExplosiveFinal,
		ApplyStatusBurnPercentageFinal,
		ApplyExplosionConsumablePercentageFinal,
		ArmorRatingUI,
		ToughnessUI,
		DefaultInventoryUI,
		ContaminationProtectionUI,
		SkillPowerUI,
		WeaponDamageCompareUI,
		WeaponRPMCompareUI,
		WeaponMagazineCompareUI,
		WeaponAccuracyCompareUI,
		WeaponRangeCompareUI,
		WeaponReloadTimeCompareUI,
		WeaponStabilityCompareUI,
		MedkitStackFinal,
		SMGAmmoFinal,
		ShotgunAmmoFinal,
		MarksmanRifleAmmoFinal,
		LMGAmmoFinal,
		AssaultRifleAmmoFinal,
		Survival_TemperatureRatingFinal,
		Survival_ColdFinal,
		Survival_DiseaseFinal,
		Survival_HungerFinal,
		Survival_ThirstFinal,
		Survival_ColdAimShakeSpeedFinal,
		Survival_UIDistanceMultiplierFinal,
		Survival_ConsumableFoodCooldownFinal,
		Survival_ConsumableDrinkCooldownFinal,
		Survival_ConsumableMedicineCooldownFinal,
		Survival_ConsumableMedicineDiminishingReturn,
		Survival_ConsumableMedicineDurationMaxTime,
		Survival_ConsumableMedicineCooldownMaxTime,
		Survival_ConsumablePainkillerCooldownFinal,
		Survival_ConsumablePainkillerDiminishingReturn,
		Survival_ConsumablePainkillerDurationMaxTime,
		Survival_ConsumablePainkillerCooldownMaxTime,
		PvPDamageMultiplierArmsFinal,
		PvPDamageMultiplierBodyFinal,
		PvPDamageMultiplierHeadFinal,
		PvPDamageMultiplierLegsFinal,
		GrenadeEMPStackFinal,
		GrenadeFlashbangStackFinal,
		GrenadeHEStackFinal,
		GrenadeIncendiaryStackFinal,
		GrenadeShockStackFinal,
		GrenadeTearGasStackFinal,
		NormalizedWeaponDamageModBonus,
		Seasons_RottenToTheCore_GlobalModifiers_BleedRadius,
		Seasons_RottenToTheCore_GlobalModifiers_HeadshotBonusTimer,
		Seasons_RottenToTheCore_GlobalModifiers_HeadshotBonusCritDamage,
		Seasons_RottenToTheCore_GlobalModifiers_CurrentHeadShotDamageBonus,
		Seasons_DangerZone_GlobalModifiers_PlayerInflictEnemyDamageExtraMultiplier,
		Seasons_DangerZone_GlobalModifiers_PlayerInflictEnemyDamageRadius,
		Seasons_DangerZone_ActivityModifiers_EnemyInflictPlayerDamageExtraMultiplier,
		Seasons_DangerZone_ActivityModifiers_EnemyInflictPlayerDamageRadius,
		Seasons_DangerZone_GroupModifiers_PlayerInflictEnemyDamageNearAllyExtraMultiplier,
		Seasons_DangerZone_GroupModifiers_PlayerInflictEnemyDamageNearAllyRadius,
		Seasons_DangerZone_GroupModifiers_EnemyInflictPlayerDamageFarAllyExtraMultiplier,
		Seasons_DangerZone_GroupModifiers_EnemyInflictPlayerDamageFarAllyRadius,
		Seasons_HandleWithCare_Active,
		Seasons_StayPut_GlobalModifiers_MaxBonusDamage,
		Seasons_StayPut_GlobalModifiers_BuildUpSpeedWhileNotMoving,
		Seasons_StayPut_GlobalModifiers_DepletionSpeedWhileMoving,
		Seasons_StayPut_GlobalModifiers_RevivedGracePeriodDuration,
		Seasons_StayPut_GroupModifiers_NearAllyRadius,
		Seasons_StayPut_GroupModifiers_NearAllyDepletionSpeed,
		Seasons_StayPut_GroupModifiers_TeamKillsRequiredAmount,
		Seasons_StayPut_GroupModifiers_TeamKillsWindowTimer,
		Seasons_StayPut_GroupModifiers_TeamKillsRewardDuration,
		Seasons_HandleWithCare_GlobalModifier_UI_ExplosionTimer,
		Seasons_PrototypeBullets_Active,
		Seasons_PrototypeBullets_MatchedWeaknessMaxHealthPercentageDamage,
		Seasons_PrototypeBullets_MatchedWeaknessDamageTakenModBonus,
		Seasons_PrototypeBullets_MatchedWeaknessDamageTakenModBonusDuration,
		Seasons_PrototypeBullets_GasBulletsAOE,
		Seasons_PrototypeBullets_MagicBulletsCooldownTime,
		Seasons_Shocker_Active
	};
}; //Size: 0x00A0

class CIndexer
{
public:
	class CIndexInfo* Indices[629]; //0x0000
}; //Size: 0x13B0

class CIndexInfo
{
public:
	CIndexInfo(const CIndexInfo&) = delete;
	static CIndexInfo& Get() 
	{
		return s_Instance;
	};

public:
	char pad_0000[8]; //0x0000
	int32_t Type; //0x0008
	char pad_000C[68]; //0x000C
	int32_t Index; //0x0050
	char pad_0054[4]; //0x0054
	char* Name; //0x0058
	char pad_0060[4]; //0x0060
	int32_t Flag; //0x0064
	char pad_0068[80]; //0x0068
	char* Dictionary; //0x00B8
	char pad_00C0[8]; //0x00C0
	char* Category; //0x00C8
	char pad_00D0[152]; //0x00D0

public:
	bool GetAttribute(int index, uint32_t& Index);

private:
	CIndexInfo() { };

	static CIndexInfo s_Instance;
}; //Size: 0x0168


class IndexModule
{
public:
	struct Indexer
	{
		uintptr_t GetOffset();
		std::string GetName();
		bool IsPointerName();

		char unknown[0x50];
		unsigned int index; // 0x50
		unsigned int unk; // 0x54
		// can sometimes be a char pointer, or actually just be an array of characters
		char* namePtr; // 0x58
		unsigned int restOfName;
		unsigned int flags; // 0x64;
	};

	enum
	{
		AimChangeAccuracyRecoveryTimeMSFinal,
		AimChangeModifierFinal,
		AimChangeSensitivityFinal,
		AimSpreadMaxFinal,
		AimSpreadMinFinal,
		AirSupplyFinal,
		AirSupplyDepletionRateFinal,
		AirSupplyRegenRateFinal,
		AirSupplyRegenTickIntervalFinal,
		AirSupplyDepletionTickIntervalFinal,
		AirSupplyDamageRateFinal,
		AirSupplyDamageIntervalFinal,
		AirSupplyEmptyDamageDelayFinal,
		FallDamageModFinal,
		FallDamageLethalHeightFinal,
		FallDamageStartHeightFinal,
		BleedingOutHealthFinal,
		BleedingOutHealthDegenRateFinal,
		BleedingOutHealthDegenTickIntervalFinal,
		BleedingOutDieQuickMultiplierFinal,
		BleedingOutReviveHealthPercentageFinal,
		ClipSizeFinal,
		CoverAimSpreadMaxFinal,
		CoverAimSpreadMinFinal,
		CoverSpreadMaxFinal,
		CoverSpreadMinFinal,
		CriticalHitChanceResilienceFinal,
		DamageDoneToSuppressedTargetModFinal,
		DamageDoneToElitesModFinal,
		DamageMultiplierArmsFinal,
		DamageMultiplierBodyFinal,
